## 1. Concat

连接

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series(["a","b","c"])
s2 = pd.Series(["d","e","f", "g"])

### a. stack

In [3]:
pd.concat([s1,s2])

0    a
1    b
2    c
0    d
1    e
2    f
3    g
dtype: object

In [4]:
pd.concat([s2,s1])

0    d
1    e
2    f
3    g
0    a
1    b
2    c
dtype: object

AS LONG AS THEY HAVE THE **SAME DIMENTION**, THEN CONCAT WORKS!

In [5]:
pd.concat([s2,s1], ignore_index = True)

0    d
1    e
2    f
3    g
4    a
5    b
6    c
dtype: object

### b. Side by side.

In [9]:
pd.concat([s2,s1], axis = 1)

   0    1
0  d    a
1  e    b
2  f    c
3  g  NaN

`keys`

In [11]:
pd.concat([s2,s1], axis = 1, keys = ["gp1", "gp2"])

  gp1  gp2
0   d    a
1   e    b
2   f    c
3   g  NaN

In [12]:
pd.concat([s2,s1], axis = 0, keys = ["gp1", "gp2"])

gp1  0    d
     1    e
     2    f
     3    g
gp2  0    a
     1    b
     2    c
dtype: object

## 2. Inner and Outer Joins

In [14]:
fruits = pd.Series(
    data=["apple", "banana", "cherry", "durian"], 
    index=["a","b", "c", "d"]
)

animals = pd.Series(
    data=["badger", "cougar", "anaconda", "elk", "pika"], 
    index=["b", "c", "a", "e", "p"]
)

In [15]:
pd.concat([animals, fruits])

b      badger
c      cougar
a    anaconda
e         elk
p        pika
a       apple
b      banana
c      cherry
d      durian
dtype: object

In [16]:
pd.concat([animals, fruits], axis = 1)

          0       1
b    badger  banana
c    cougar  cherry
a  anaconda   apple
e       elk     NaN
p      pika     NaN
d       NaN  durian

There is no label at index e, so in group 1, there is a NaN.

In [17]:
pd.concat([animals, fruits], axis = 1, join = "inner")

          0       1
b    badger  banana
c    cougar  cherry
a  anaconda   apple

Default is `outer`. `inner` are overlapped values.

## 3. Concat Dataframe

### a. with columns

In [19]:
harvest_21 = pd.DataFrame(
    [['potatoes', 900], ['garlic', 1350], ['onions', 875]], 
    columns=['crop', 'qty']
)

harvest_22 = pd.DataFrame(
    [['garlic', 1600], ['spinach', 560], ['turnips', 999], ['onions', 1000]], 
    columns=['crop', 'qty']
)

In [20]:
pd.concat([harvest_21, harvest_22], keys=[2021, 2022])

            crop   qty
2021 0  potatoes   900
     1    garlic  1350
     2    onions   875
2022 0    garlic  1600
     1   spinach   560
     2   turnips   999
     3    onions  1000

In [23]:
harvest_23 = pd.DataFrame(
    [['potatoes', 90, 500], ['garlic', 1350, 1000], ['onions', 875,640]], 
    columns=['crop', 'qty', 'profit']
)

In [22]:
harvest_23

       crop   qty  profit
0  potatoes    90     500
1    garlic  1350    1000
2    onions   875     640

In [25]:
pd.concat([harvest_21, harvest_22, harvest_23] )

       crop   qty  profit
0  potatoes    90   500.0
1    garlic  1350  1000.0
2    onions   875   640.0
0    garlic  1600     NaN
1   spinach   560     NaN
2   turnips   999     NaN
3    onions  1000     NaN
0  potatoes    90   500.0
1    garlic  1350  1000.0
2    onions   875   640.0

### b. with index

In [26]:
livestock = pd.DataFrame(
    [['pasture', 9], ['stable', 3], ['coop', 34]], 
    columns=['location', 'qty'],
    index=['alpaca', 'horse', 'chicken']
)
weights = pd.DataFrame(
    [[4,10], [900, 2000], [1.2, 4], [110, 150]], 
    columns=['min_weight', 'max_weight'],
    index=['chicken', 'horse', 'duck', 'alpaca']
)

In [27]:
livestock

        location  qty
alpaca   pasture    9
horse     stable    3
chicken     coop   34

In [29]:
weights

         min_weight  max_weight
chicken         4.0          10
horse         900.0        2000
duck            1.2           4
alpaca        110.0         150

In [30]:
pd.concat([livestock, weights])

        location   qty  min_weight  max_weight
alpaca   pasture   9.0         NaN         NaN
horse     stable   3.0         NaN         NaN
chicken     coop  34.0         NaN         NaN
chicken      NaN   NaN         4.0        10.0
horse        NaN   NaN       900.0      2000.0
duck         NaN   NaN         1.2         4.0
alpaca       NaN   NaN       110.0       150.0

In [31]:
pd.concat([livestock, weights], axis = 1)

        location   qty  min_weight  max_weight
alpaca   pasture   9.0       110.0         150
horse     stable   3.0       900.0        2000
chicken     coop  34.0         4.0          10
duck         NaN   NaN         1.2           4

## 4. Merge

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html#pandas.DataFrame.merge

In [32]:
teams = pd.DataFrame(
    [
        ["Suns", "Phoenix", 20, 4], 
        ["Mavericks", "Dallas", 11,12], 
        ["Rockets", "Houston", 7, 16],
        ['Nuggets', "Denver", 11, 12]
    ], 
    columns=["team", "city", "wins", "losses"]
)
cities = pd.DataFrame(
    [
        ["Houston", "Texas", 2310000], 
        ["Phoenix", "Arizona", 1630000], 
        ["San Diego", "California", 1410000],
        ["Dallas", "Texas", 1310000]
    ],
    columns=["city", "state", "population"]
)

In [33]:
teams

        team     city  wins  losses
0       Suns  Phoenix    20       4
1  Mavericks   Dallas    11      12
2    Rockets  Houston     7      16
3    Nuggets   Denver    11      12

In [34]:
cities

        city       state  population
0    Houston       Texas     2310000
1    Phoenix     Arizona     1630000
2  San Diego  California     1410000
3     Dallas       Texas     1310000

In [35]:
teams.merge(cities)

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona     1630000
1  Mavericks   Dallas    11      12    Texas     1310000
2    Rockets  Houston     7      16    Texas     2310000

Only cities that overlapped are shown up.

**a. how**: `{‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}`, default ‘inner’
Type of merge to be performed.

+ left: use only keys from left frame, similar to a SQL left outer join; preserve key order.

+ right: use only keys from right frame, similar to a SQL right outer join; preserve key order.

+ outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.

+ inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.

+ cross: creates the cartesian product from both frames, preserves the order of the left keys.

In [37]:
teams.merge(cities, how = "left")

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona   1630000.0
1  Mavericks   Dallas    11      12    Texas   1310000.0
2    Rockets  Houston     7      16    Texas   2310000.0
3    Nuggets   Denver    11      12      NaN         NaN

Join from the left dataframe. The city denver will be kept, but since it doesn't show up at the right dataframe, the joint data will not include right data.

In [38]:
teams.merge(cities, how = "right")

        team       city  wins  losses       state  population
0    Rockets    Houston   7.0    16.0       Texas     2310000
1       Suns    Phoenix  20.0     4.0     Arizona     1630000
2        NaN  San Diego   NaN     NaN  California     1410000
3  Mavericks     Dallas  11.0    12.0       Texas     1310000

San Diego is also included.

In [39]:
teams.merge(cities, how = "outer")

        team       city  wins  losses       state  population
0       Suns    Phoenix  20.0     4.0     Arizona   1630000.0
1  Mavericks     Dallas  11.0    12.0       Texas   1310000.0
2    Rockets    Houston   7.0    16.0       Texas   2310000.0
3    Nuggets     Denver  11.0    12.0         NaN         NaN
4        NaN  San Diego   NaN     NaN  California   1410000.0

**b. `on`**: Column or index level names to join on. These must be found in both DataFrames. If on is None and not merging on indexes then this defaults to the intersection of the columns in both DataFrames.

In [41]:
midterms = pd.DataFrame(
    [['alex', 'padilla', 92], ['rayna', 'wilson', 83], ['juan', 'gomez', 78], ['angela', 'smith', 66],['stephen', 'yu', 98]], 
    columns=['first', 'last', 'score']
)
finals = pd.DataFrame(
    [['alex','padilla', 97, False], ['rayna', 'wilson', 88, False], ['alex', 'smith', 86, True], ['juan', 'gomez', 71, True], ['stephen', 'yu', 78, False], ['sakura', 'steel', 100, True]], 
    columns=['first', 'last','score', 'extra_credit']
)

In [42]:
midterms

     first     last  score
0     alex  padilla     92
1    rayna   wilson     83
2     juan    gomez     78
3   angela    smith     66
4  stephen       yu     98

In [43]:
finals

     first     last  score  extra_credit
0     alex  padilla     97         False
1    rayna   wilson     88         False
2     alex    smith     86          True
3     juan    gomez     71          True
4  stephen       yu     78         False
5   sakura    steel    100          True

In [45]:
midterms.merge(finals, on = "score")

  first_x last_x  score  first_y last_y  extra_credit
0    juan  gomez     78  stephen     yu         False

Only 1 match. Becuase only the score "78" appears twice in 2 dataframes.

In [46]:
 midterms.merge(finals, on = "first")

     first   last_x  score_x   last_y  score_y  extra_credit
0     alex  padilla       92  padilla       97         False
1     alex  padilla       92    smith       86          True
2    rayna   wilson       83   wilson       88         False
3     juan    gomez       78    gomez       71          True
4  stephen       yu       98       yu       78         False

In [47]:
 midterms.merge(finals, on = ["first","last"])

     first     last  score_x  score_y  extra_credit
0     alex  padilla       92       97         False
1    rayna   wilson       83       88         False
2     juan    gomez       78       71          True
3  stephen       yu       98       78         False

Because both 2 dataframes have score as their column, so we better specify the `score_x` and `score_y`.

In [49]:
 df = midterms.merge(finals, on = ["first","last"], suffixes = ("_mid", "_final"))

In [50]:
df["avg"] = (df["score_mid"] + df["score_final"]) / 2

In [51]:
df

     first     last  score_mid  score_final  extra_credit   avg
0     alex  padilla         92           97         False  94.5
1    rayna   wilson         83           88         False  85.5
2     juan    gomez         78           71          True  74.5
3  stephen       yu         98           78         False  88.0